cmsis-svd/cmsis-svd/data/STMicro/STM32L0x0.svd
            <register>
               <name>APB1SMENR</name>
               <displayName>APB1SMENR</displayName>
               <description>APB1 peripheral clock enable in sleep mode           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xB8E64A11</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1SMEN</name>
                     <description>Low power timer clock enable during               sleep mode bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRSMEN</name>
                     <description>Power interface clock enable during               sleep mode bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSSMEN</name>
                     <description>Clock recovery system clock enable               during sleep mode bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2SMEN</name>
                     <description>I2C2 clock enable during sleep mode               bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SMEN</name>
                     <description>I2C1 clock enable during sleep mode               bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SMEN</name>
                     <description>LPUART1 clock enable during sleep mode               bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SMEN</name>
                     <description>UART2 clock enable during sleep mode               bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2SMEN</name>
                     <description>SPI2 clock enable during sleep mode               bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGSMEN</name>
                     <description>Window watchdog clock enable during               sleep mode bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM6SMEN</name>
                     <description>Timer 6 clock enable during sleep mode               bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2SMEN</name>
                     <description>Timer2 clock enable during sleep mode               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM3SMEN</name>
                     <description>Timer 3 clock enable during sleep mode               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM7SMEN</name>
                     <description>Timer 7 clock enable during sleep mode               bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART4SMEN</name>
                     <description>USART4 clock enabe during sleep mode               bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART5SMEN</name>
                     <description>USART5 clock enable during sleep mode               bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SMEN</name>
                     <description>I2C3 clock enable during sleep mode               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCIPR</name>
               <displayName>CCIPR</displayName>
               <description>Clock configuration register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1SEL1</name>
                     <description>Low Power Timer clock source selection               bits</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1SEL0</name>
                     <description>LPTIM1SEL0</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL1</name>
                     <description>I2C1 clock source selection               bits</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL0</name>
                     <description>I2C1SEL0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SEL1</name>
                     <description>LPUART1 clock source selection               bits</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SEL0</name>
                     <description>LPUART1SEL0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SEL1</name>
                     <description>USART2 clock source selection               bits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SEL0</name>
                     <description>USART2SEL0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SEL1</name>
                     <description>USART1 clock source selection               bits</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SEL0</name>
                     <description>USART1SEL0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SEL0</name>
                     <description>I2C3 clock source selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SEL1</name>
                     <description>I2C3 clock source selection               bits</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>Control and status register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <resetValue>0x0C000000</resetValue>
               <fields>
                  <field>
                     <name>LPWRSTF</name>
                     <description>Low-power reset flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WWDGRSTF</name>
                     <description>Window watchdog reset flag</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IWDGRSTF</name>
                     <description>Independent watchdog reset               flag</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SFTRSTF</name>
                     <description>Software reset flag</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PORRSTF</name>
                     <description>POR/PDR reset flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PINRSTF</name>
                     <description>PIN reset flag</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OBLRSTF</name>
                     <description>OBLRSTF</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FWRSTF</name>
                     <description>Firewall reset flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCRST</name>
                     <description>RTC software reset bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCEN</name>
                     <description>RTC clock enable bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC and LCD clock source selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CSSLSED</name>
                     <description>CSS on LSE failure detection               flag</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CSSLSEON</name>
                     <description>CSSLSEON</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSEDRV</name>
                     <description>LSEDRV</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSEBYP</name>
                     <description>External low-speed oscillator bypass               bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSERDY</name>
                     <description>External low-speed oscillator ready               bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSEON</name>
                     <description>External low-speed oscillator enable               bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSIRDY</name>
                     <description>Internal low-speed oscillator ready               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSION</name>
                     <description>Internal low-speed oscillator               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSIIWDGLP</name>
                     <description>LSI clock input to IWDG in               Ultra-low-power mode (Stop and Standby) enable               bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RMVF</name>
                     <description>Remove reset flag</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
